the
picture
of
dorian
gray
by
chapter
i.
.
artist
is
creator
beautiful
things
to
art
and
’
s
he
who
can
into
another
manner
or
a
new
his
impression
highest
as
form
mode
those
find
ugly
in
are
without
being
charming
this
for
these
there
hope
they
whom
mean
only
beauty
no
such
thing
moral
an
book
books
well
written
,
that
all
century
rage
seeing
own
face
glass
not
life
man
forms
part
but
perfect
use
prove
anything
even
true
be
proved
has
sympathy
ever
express
everything
thought
language
instruments
vice
virtue
from
point
view
type
feeling
at
once
go
beneath
do
so
their
peril
read
it
really
opinion
about
work
when
with
himself
we
forgive
making
useful
long
does
excuse
useless
one
quite
studio
was
filled
rich
odour
roses
light
summer
wind
stirred
amidst
trees
garden
came
through
open
door
heavy
more
delicate
corner
on
which
lying
lord
henry
could
just
catch
whose
branches
seemed
hardly
able
bear
burden
;
now
then
fantastic
shadows
birds
across
were
stretched
front
huge
window
kind
effect
him
think
pallid
seek
convey
sense
way
grass
round
gilt
make
dim
london
like
note
distant
room
stood
portrait
young
extraordinary
personal
some
little
distance
away
sitting
basil
hallward
sudden
years
ago
caused
time
public
excitement
gave
rise
many
strange
painter
looked
had
smile
pleasure
passed
suddenly
started
up
closing
eyes
placed
fingers
upon
though
sought
within
brain
curious
dream
feared
might
awake
“
your
best
you
have
done
”
said
must
certainly
send
next
year
too
large
vulgar
whenever
i
gone
been
either
people
see
dreadful
worse
don
t
shall
anywhere
answered
head
back
odd
used
friends
laugh
won
eyebrows
amazement
thin
blue
smoke
cigarette
?
my
dear
fellow
why
any
reason
what
!
world
gain
soon
seem
want
throw
silly
than
talked
would
set
far
above
men
england
old
jealous
if
capable
know
will
me
replied
exhibit
put
much
myself
it.
out
laughed
yes
knew
yourself
word
didn
vain
between
strong
hair
looks
made
ivory
course
intellectual
expression
real
where
begins
intellect
itself
moment
down
becomes
nose
forehead
something
horrid
look
learned
how
perfectly
hideous
except
church
keeps
saying
age
told
say
boy
natural
always
absolutely
delightful
mysterious
friend
name
never
thinks
feel
sure
creature
should
here
winter
flowers
chill
our
:
least
him.
understand
harry
am
indeed
sorry
shoulders
telling
truth
physical
sort
seems
dog
history
steps
better
different
fellows
sit
ease
play
nothing
spared
knowledge
live
indifferent
neither
bring
ruin
others
nor
receive
hands
wealth
whatever
may
worth
good
suffer
given
us
asked
walking
towards
tell
you.
oh
explain
names
them
grown
love
modern
marvellous
leave
town
going
did
lose
habit
dare
somehow
great
deal
romance
suppose
foolish
forget
married
charm
marriage
makes
necessary
both
wife
knows
doing
meet
dine
together
each
other
most
absurd
serious
faces
very
fact
she
over
her
sometimes
wish
merely
me.
hate
talk
led
believe
husband
thoroughly
virtues
wrong
simply
cried
laughing
two
went
themselves
seat
tall
sunlight
leaves
white
after
pause
pulled
watch
afraid
murmured
before
question
keeping
fixed
ground
because
looking
straight
every
painted
accident
occasion
revealed
rather
coloured
canvas
shown
secret
expectation
continued
companion
perhaps
smiled
leaning
examined
gazing
intently
golden
shook
stars
moved
air
began
wall
past
its
brown
wings
felt
hear
heart
beating
wondered
coming
story
months
lady
poor
show
ourselves
society
evening
coat
anybody
ten
minutes
talking
tedious
became
conscious
turned
saw
first
met
growing
pale
sensation
terror
come
mere
personality
fascinating
allowed
whole
nature
soul
influence
master
till
terrible
fate
store
exquisite
sorrows
grew
quit
conscience
take
credit
trying
same
firm
all.
however
pride
struggled
against
‘
run
mr.
curiously
shrill
voice
nervous
get
rid
brought
ladies
spoke
dearest
took
mine
success
found
strangely
close
almost
touching
again
spoken
afterwards
describe
wonderful
goes
giving
remember
gentleman
covered
ear
tragic
whisper
everybody
details
fled
exactly
entirely
tells
wants
hard
tried
succeeded
opening
mother
help
once.
laughter
bad
beginning
friendship
matter
horribly
hat
clouds
silk
sky
difference
choose
enemies
careful
choice
got
power
according
less
brother
care
die
younger
exclaimed
relations
comes
none
stand
having
english
call
masses
special
property
court
indignation
magnificent
yet
single
pointed
second
forward
idea
dreams
whether
right
importance
value
case
propose
else
often
day
couldn
happy
gravely
appearance
also
late
greek
paint
draw
since
wonder
suggested
hidden
days
says
visible
presence
lad
means
lines
fresh
passion
romantic
spirit
madness
separated
offered
while
painting
sat
beside
subtle
plain
walked
present
image
certain
loveliness
colours
speak
guess
bare
shallow
under
nowadays
broken
create
meant
lost
fond
considered
few
moments
dreadfully
rule
thousand
delight
pain
flower
bit
vanity
sad
doubt
genius
longer
wild
struggle
existence
fill
minds
facts
place
ideal
mind
dust
proper
drawing
tone
colour
bitterly
cold
pity
alter
worst
change
ah
faithful
side
struck
silver
satisfied
phrase
green
pleasant
emotions
ideas
passions
silent
missed
aunt
conversation
necessity
class
exercise
lives
dignity
labour
escaped
strike
remembered
heard
slight
angry
agatha
discovered
east
end
bound
state
women
earnest
feet
known
glad
sir
servant
ask
wait
bowed
walk
simple
try
wide
person
gives
trust
slowly
words
nonsense
smiling
taking
arm
house
entered
seated
turning
forest
learn
to-day
tired
caught
sight
faint
cheeks
pardon
spoiled
meeting
hand
black
promised
club
last
forgot
played
frightened
peace
devoted
matters
probably
enough
nice
wonderfully
scarlet
lips
gold
youth
passionate
purity
kept
flung
opened
busy
getting
ready
glanced
hesitated
finish
rude
please
moods
besides
subject
stop
lip
wishes
stay
laws
good-bye
afternoon
street
nearly
home
five
o
clock
write
miss
dull
standing
working
listen
unfortunate
difficulty
move
pay
attention
stepped
taken
fancy
scientific
give
thoughts
sins
music
forgotten
duties
duty
self
souls
courage
race
god
turn
deep
seen
low
fully
reality
impulse
joy
return
amongst
body
sin
action
remains
recollection
regret
yield
sick
desire
monstrous
events
boyhood
sleeping
memory
cheek
answer
let
motionless
parted
bright
chance
touched
troubled
times
created
clear
vivid
cruel
escape
sweet
understood
fire
watched
interested
produced
passing
experience
shot
mark
touch
rate
strength
unconscious
silence
still
hot
drink
bell
join
later
keep
cool
wine
shoulder
cure
senses
drew
fear
awakened
nerve
left
trembling
secrets
creation
worn
stranger
altered
mystery
girl
allow
become
wrinkled
terribly
...
higher
explanation
reflection
dark
waters
moon
divine
....
judge
quickly
discover
content
bitter
month
nearer
listening
ignorant
common
false
searching
sensations
season
yellow
purple
night
hold
twenty
limbs
fail
listened
fell
tiny
interest
high
emotion
flew
gently
appeared
signs
waiting
rose
shudder
using
sweep
sound
broke
quarter
hour
stopped
finished
wrote
letters
obliged
due
isn
flushed
speaking
meaning
warning
shadow
full
grace
figure
pass
sharp
knife
mist
tears
ice
laid
understanding
wouldn
greatest
grow
horrible
remain
older
particular
object
strongly
happened
burning
taught
kill
takes
mock
tore
buried
muttered
quarrel
piece
destroy
three
them.
lifted
pillow
among
dry
leaped
rushing
murder
recovered
surprise
that.
sent
rang
tea
refuge
scenes
stage
animal
doesn
do.
yours
reminded
extremely
morning
lived
knock
small
table
poured
theatre
to-night
somewhere
wire
ill
bore
putting
lot
alone
cup
sadly
sighed
entreat
watching
dress
outside
interesting
closed
behind
sofa
half-past
twelve
strolled
uncle
somewhat
called
selfish
father
retired
service
paris
post
birth
son
along
study
houses
trouble
paid
advantage
afford
wood
office
during
period
valet
country
dogs
rough
early
pure
family
affection
assure
george
money
imagine
information
although
examination
expect
margaret
marry
running
foot
yesterday
killed
brute
daughter
business
died
fall
selby
hated
noble
treated
off
creatures
earth
mad
knees
wasn
american
ain
girls
ll
clever
parents
rising
sake
america
pretty
anxious
lunch
thanks
wanted
woman
humanity
direction
square
weeks
happiness
cut
short
crime
agony
child
born
death
solitude
blow
dinner
startled
opposite
red
playing
bow
views
added
field
showing
herself
shapes
becoming
knowing
already
half
hall
dining-room
usual
shaking
duchess
temper
described
thomas
followed
private
thinking
wise
occupied
erskine
considerable
fallen
explained
mrs.
fortunately
remarked
excellent
raising
puzzled
whispered
exhausted
privilege
goodness
inhabitants
confess
clothes
travelled
visit
order
force
below
tight
persuade
glance
unhappy
suffering
important
grave
keenly
weather
science
lead
guilty
future
sign
committed
theory
dangerous
ran
philosophy
hills
slow
press
waves
sides
consciousness
wished
imagination
spell
smiles
shape
carriage
despair
rooms
chair
scene
harsh
swept
reading
lovely
consider
fortunate
host
complete
sleep
park
promise
library
raised
lay
copy
annoyed
twice
step
vague
usually
returned
picturesque
loud
hearing
ve
hours
breaking
drive
rain
leaving
lit
sibyl
her.
triumph
ought
supper
mistake
veins
piccadilly
curiosity
poison
seven
determined
search
adventure
grey
ours
danger
expected
wandered
streets
eight
beheld
box
monster
loved
curtain
empty
innocent
juliet
admit
wretched
act
drove
drawn
tragedy
terms
notes
dawn
stir
vane
follow
gloom
tomb
lover
wandering
king
taste
throat
ordinary
easily
loving
helped
crimes
sacred
dead
beyond
lights
arrived
assured
insisted
calling
heavily
ruined
honour
third
thrown
gentle
elaborate
children
prince
examining
opera
several
to-morrow
breath
wake
worship
burned
excited
borne
flame
crept
result
west
impossible
six
week
frame
need
handkerchief
pleased
begun
human
received
waited
immediately
spring
figures
wounds
ceased
difficult
decide
various
union
absolute
character
showed
avoid
active
cause
loathing
method
arrive
instinct
changed
deceived
dreaming
sunset
windows
telegram
engaged
contained
repeated
acting
advanced
fifty
james
sum
paused
blood
quick
trembled
hide
free
prison
kiss
mouth
warm
discovery
cunning
moving
worthy
proud
coarse
rushed
arms
neck
kissed
falling
movement
sister
jim
sigh
joined
increased
situation
position
fortune
upstairs
stern
hers
attack
solicitor
chosen
harm
accustomed
road
company
ship
sail
save
wicked
sailor
sails
vessel
captain
immense
places
carried
horse
spend
pray
gloomy
account
infinite
begin
reached
ears
loose
train
plans
poverty
flies
hundred
surely
crowd
cloud
hopes
effort
jumped
seized
space
heaven
horror
utterly
lie
fierce
hatred
downstairs
minute
thrust
leaden
mercy
relief
dreaded
measure
disappointment
direct
gradually
connected
asking
track
swear
gesture
freely
renewed
opportunity
desolate
expressed
news
remembrance
tied
miserable
possibly
notice
add
forced
possession
qualities
contempt
dressed
wore
around
mention
misery
fine
possible
beast
shame
loves
belief
claim
accept
ways
remorse
demand
interrupted
prevent
carrying
arranged
loss
top
heat
hung
voices
living
weep
feels
flesh
mirror
tremble
band
water
rested
devotion
holy
dared
failed
moonlight
thou
painful
professor
leaned
thee
cease
ere
storm
waste
heavens
remaining
dragged
believed
pressed
fit
floor
calm
wept
darkness
thanked
eat
midnight
line
doors
stones
asleep
lantern
chamber
eye
finally
cruelty
blind
noticed
ardent
apparent
threw
uttered
bloom
suffered
centuries
torture
sorrow
held
wrought
fascination
screen
noon
awoke
victor
softly
slept
aside
french
breakfast
shut
evil
tale
examine
concealed
locked
shuddered
guide
four
double
letter
remained
sinking
break
cry
grasp
papers
inquest
nerves
murdered
actually
addressed
kindly
weak
melancholy
occur
hurt
violence
rest
awful
fearful
utter
bed
anxiety
continue
console
consolation
mentioned
happen
key
lonely
fight
number
lamps
further
occurred
hoped
cursed
decided
eternal
fair
mockery
mood
loathsome
prayer
nay
safe
former
finding
following
address
paper
quiet
horrors
enjoy
spent
law
miseries
surprised
length
starting
arrange
especially
autumn
de
october
solemnly
fatal
ages
thus
presented
worked
resolved
refuse
intended
instead
guard
memories
comfortable
thank
detail
pocket
near
pall
corruption
corpse
alive
admiration
saved
holding
south
favour
delighted
aid
chains
carry
desired
hanging
secure
enter
kindness
footsteps
slightly
torn
edges
st.
evident
greatly
affected
evidence
dr.
report
marked
obscure
spiritual
solitary
nine
procured
dread
apparently
latter
innocence
returning
rare
fashion
attempt
conduct
justice
stronger
purpose
ignorance
driving
desert
companions
nights
appear
forth
degrees
restored
lies
energy
objects
ardour
condition
daily
wafer
breast
inn
woke
woods
walls
beat
blew
mighty
collected
sweetness
amsterdam
rendered
anger
cast
deprived
stone
arabian
city
john
behold
visited
previous
performed
longed
sun
rocks
formed
prepared
possessed
spread
gate
fields
until
driven
endure
absence
rush
foreign
sailors
attempted
sufficient
instinctively
manners
conceive
elizabeth
record
circumstance
lest
fiend
reported
doctor
enemy
d
dying
blessed
november
eleven
fast
bag
fog
delay
travel
tongue
native
land
proceeded
respect
lamp
closer
flash
quietly
diary
lock
foul
unable
destroyed
hell
gazed
lesson
snow
hush
seconds
tear
spot
vanished
iron
questions
servants
reflected
passage
alan
campbell
warmth
greater
motioned
handed
fly
gained
laboratory
scarcely
party
suspense
edge
food
pallor
supposed
trace
raise
finger
devil
unless
carefully
ghastly
fever
ring
envelope
ones
rapidly
wet
required
hurried
smell
narborough
bent
easy
hurry
neighbourhood
ernest
eagerly
thirst
hearts
criminal
sounds
jack
sorts
weakness
precious
geoffrey
driver
river
hid
narrow
mile
endured
hunger
circle
intense
needed
clung
peculiar
teeth
nodded
brandy
curse
pursuit
destiny
freedom
hastened
pointing
clue
board
vengeance
start
disappeared
plan
deadly
cousin
safety
flapping
sea
crying
excess
anguish
convinced
victim
fears
lake
cart
guest
misfortune
endless
charge
peasant
wheel
upset
reply
consult
path
yard
support
reach
village
equal
strain
lately
police
keys
lower
degree
soft
effects
faith
deeply
intention
experienced
crossed
churchyard
disease
dracula
&
jonathan
harker
journal
mina
murray
august
lucy
westenra
seward
phonograph
van
helsing
(
)
--
p.
m.
station
entering
hotel
regarding
transylvania
extreme
midst
mountains
castle
bistritz
count
north
descended
gathered
howling
soundly
steep
peasants
big
slovaks
borgo
directed
evidently
welcome
journey
may._
coach
comfort
therefore
crucifix
regard
writing
whilst
*
horizon
sleepy
naturally
cat
vampire
cross
unknown
sorrowful
crossing
horses
mass
general
turk
hasten
rock
snowy
hill
mountain
wound
sank
approached
solemn
grim
speed
urged
boat
thunder
rays
gladness
shock
wolves
shelter
disturbed
scream
altogether
approach
command
courtyard
vast
purchase
patient
conclusion
instant
rejoiced
seemingly
hawkins
confidence
disposition
attend
broad
hitherto
valley
feelings
enjoyed
customs
alas
agent
exeter
affairs
generally
spirits
destruction
studied
surrounded
ancient
carfax
stream
thick
chapel
lunatic
asylum
sunshine
gay
presently
whitby
tide
uneasy
fury
conviction
helpless
doubtless
desperate
proof
garlic
bless
meantime
suspicion
brave
thousands
sleeps
woe
forces
residence
labours
bearing
circumstances
protect
varna
overcome
speech
_later._
imagined
powers
sane
repose
shone
positively
satisfy
task
fastened
tones
szgany
stole
boxes
shortly
hereafter
agitation
sprang
astonishment
_30
lid
entry
violent
_letter
studies
holmwood
arthur
september
truly
morris
quincey
sweetly
burst
m
anyhow
_dr
diary._
commence
renfield
shore
health
july
harbour
breeze
banks
_1
august._
ye
weight
otherwise
farewell
cliff
beloved
favourite
pier
spiders
cheerfully
request
m._
attendant
_mina
journal._
godalming
angel
cheerful
summit
port
deck
removed
arrival
concerning
landed
accordingly
voyage
crew
mate
agreed
armed
deserted
relieve
madman
sunrise
funeral
waking
coffin
breathing
scar
bat
restore
utmost
_
disturb
nurse
bosom
madam
illness
gentleness
attendants
resolution
mortal
superior
prepare
whither
waked
september._
mankind
bestow
alarmed
deeper
eager
operation
attended
wolf
darling
frightful
grief
grateful
wretch
proceed
dr
sunk
tenderly
enthusiasm
revenge
species
trance
un-dead
stake
consent
render
employed
trial
departure
immediate
instantly
acquainted
beings
abhorred
reflect
guilt
rats
partly
enterprise
departed
october._
prospect
confined
hellish
switzerland
countenance
progress
hypnotise
pursue
_czarina
catherine_
hypnotic
galatz
endeavour
skinsky
sledge
pursued
frankenstein
undertaking
reflections
ocean
perceived
bestowed
quitted
continually
observed
fatigue
sufferings
dæmon
compassion
amiable
endeavoured
misfortunes
event
related
wretchedness
geneva
benevolent
tranquillity
occupations
clerval
ingolstadt
conceived
justine
william
murderer
mont
thy
magistrate
condemned
cottage
hovel
cottagers
felix
safie
protectors
kirwin
